SM_для_EDT/src/InformationRegisters/впЗапчасти/впЗапчасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>впЗапчасти</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.впОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/рспбСтатусыНоменклатуры/рспбСтатусыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рспбСтатусыНоменклатуры</name>
  <enumValues>
    <name>НеЗаблокирован</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = Неопределено</comment>
  </enumValues>
  <enumValues>
    <name>БлокирДляЗаготов</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;01&quot;. Запрещено: Планирование потребности, Закупки</comment>
  </enumValues>
  <enumValues>
    <name>БлокирДляТехнКарты</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;02&quot;. Запрещено: Использование в спецификациях и техкартах</comment>
  </enumValues>
  <enumValues>
    <name>БлокированиеДвижений</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;DL&quot;. Запрещено Планирование потребности, Закупки, Прогнозирование,Использование в спецификациях и техкартах,Система управления запасами (складские движения),Сообщения\Заказы ТОРО, производственные заказы</comment>
  </enumValues>
  <enumValues>
    <name>БлокирДляСклада</name>
    <comment>ОбщиеДанныеXDTO.MSTAE = &quot;05&quot;. Запрещено Система управления запасами (складские движения),Использование в спецификациях и техкартах,Сообщения\Заказы ТОРО, производственные заказы</comment>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМасло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТопливо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(рарус)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>рспбКодMDG</name>
    <comment>Рарус-СПб Бойко А.Ю.23.09.2019</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.рарусКатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>CatalogRef.впПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНоменклатуры</name>
    <comment>Для реализации механизма различных блокировок SAP</comment>
    <type>
      <types>EnumRef.рспбСтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <comment>makole ЗНИ РАIT-0023374</comment>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/CommonModules/рарусНоменклатураСервер/Module.bsl
Функция ЭтоЗаблокированнаяНоменклатура(Номенклатура) Экспорт
	
	Возврат ЗначениеЗаполнено(Номенклатура.СтатусНоменклатуры)
		И Номенклатура.СтатусНоменклатуры <> Перечисления.рспбСтатусыНоменклатуры.НеЗаблокирован;
	
КонецФункции
	
Функция НоменклатураПоОбъектамРемонта(ОбъектыРемонта) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектыРемонта", ОбъектыРемонта);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впОбъектыРемонта.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОбъектыРемонта
	|ИЗ
	|	Справочник.впОбъектыРемонта КАК впОбъектыРемонта
	|ГДЕ
	|	впОбъектыРемонта.Ссылка В(&ОбъектыРемонта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
	|	ЕСТЬNULL(впЗапчасти.Номенклатура, НЕОПРЕДЕЛЕНО) КАК Номенклатура
	|ИЗ
	|	ОбъектыРемонта КАК ОбъектыРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗапчасти КАК впЗапчасти
	|		ПО ОбъектыРемонта.Ссылка = впЗапчасти.ОбъектРемонта";
	
	НоменклатураПоОбъектам = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		Если НоменклатураПоОбъектам.Получить(Выборка.ОбъектРемонта) = Неопределено тогда
			НоменклатураПоОбъектам.Вставить(Выборка.ОбъектРемонта, Новый Массив);	
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) тогда
			НоменклатураПоОбъектам[Выборка.ОбъектРемонта].Добавить(Выборка.Номенклатура);	
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат НоменклатураПоОбъектам;
	
КонецФункции	

Функция НоменклатураПоОбъектуРемонта(ОбъектРемонта, Строго = Ложь) Экспорт 
	
	МассивНоменклатуры = Новый Массив;
	
	Если Строго тогда
		
		Массив = Новый Массив;
		
		Массив.Добавить(ОбъектРемонта);
		
		НоменклатураПоОбъектам = НоменклатураПоОбъектамРемонта(Массив);
		
		МассивНоменклатуры = НоменклатураПоОбъектам[ОбъектРемонта];
		
	Иначе
		
		МассивНоменклатуры = НоменклатураПоОбъектуРемонтаИерархия(ОбъектРемонта);
		
	КонецЕсли;
	
	Возврат МассивНоменклатуры;
	
КонецФункции	

Функция НоменклатураПоОбъектуРемонтаИерархия(ОбъектРемонта) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впОбъектыРемонта.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОбъектыРемонта
	|ИЗ
	|	Справочник.впОбъектыРемонта КАК впОбъектыРемонта
	|ГДЕ
	|	впОбъектыРемонта.Ссылка В Иерархии(&ОбъектРемонта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРемонта.Ссылка КАК ОбъектРемонта,
	|	ЕСТЬNULL(впЗапчасти.Номенклатура, НЕОПРЕДЕЛЕНО) КАК Номенклатура
	|ИЗ
	|	ОбъектыРемонта КАК ОбъектыРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.впЗапчасти КАК впЗапчасти
	|		ПО ОбъектыРемонта.Ссылка = впЗапчасти.ОбъектРемонта";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() цикл
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) тогда
			Массив.Добавить(Выборка.Номенклатура);	
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат Массив;
	
КонецФункции

Процедура УстановитьОтборПоОбъектуРемонта(Форма, ОбъектРемонта) Экспорт
	
	МассивНоменклатуры = рарусНоменклатураСервер.НоменклатураПоОбъектуРемонта(ОбъектРемонта);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.СписокНоменклатура, "Номенклатура", МассивНоменклатуры, 
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	
КонецПроцедуры

//rarus_AfoD 31.08.2021 < 
Процедура УстановитьОтборПоКатегории(Форма, Категория) Экспорт
	
	МассивНоменклатуры = НоменклатураПоКатегории(Категория);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.СписокНоменклатура, "Номенклатура", МассивНоменклатуры, 
				ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	
КонецПроцедуры

Функция НоменклатураПоКатегориямВыдаваемымЭкипажу() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	рарусКатегорииНоменклатуры.Ссылка КАК Категория
	               |ИЗ
	               |	Справочник.рарусКатегорииНоменклатуры КАК рарусКатегорииНоменклатуры
	               |ГДЕ
	               |	рарусКатегорииНоменклатуры.ВыдаетсяЭкипажу";
	
	МассивТиповНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Категория");
		
	Возврат МассивТиповНоменклатуры;
	
КонецФункции

Функция НоменклатураПоКатегории(Категория) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Категория = &Категория";
	
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
	Возврат МассивНоменклатуры;
	
КонецФункции
//rarus_AfoD 31.08.2021 > 

// ++ rarus makole 2021-06-23 [РАIT-0023374]
// Учёт номенклатуры разного качества 

// Процедура проверки соответствия вида номенклатуры товаров другого качества виду номенклатуры исходного качества.
// Для номенклатуры, по которой ведется учет серий, товары другого качества должны быть одного вида с исходными.
//
// Параметры:
//	Объект - ДокументОбъект - документ, для которого проверяется соответствие номенклатуры;
//	Отказ - Булево - отказ продолжения операции;
//	ИмяТЧДляПроверки - Строка - значение по умолчанию "Товары";
//	ТаблицаДляПроверки - ТаблицаЗначений, Неопределено - если передана таблица значений, то проверяется она, попытка выгрузки из объекта не делается:
//		* НомерСтроки - Число;
//		* Номенклатура - СправочникСсылка.Номенклатура;
//		* НоменклатураОприходование - СправочникСсылка.Номенклатура.
//
Процедура ПроверитьВидНоменклатурыОприходования(Объект, Отказ, ИмяТЧДляПроверки = "Товары", ТаблицаДляПроверки = Неопределено) Экспорт
	
	//ПАН+ Нет никаких серий в судовом модуле
	Возврат;	
	//ПАН-
	
	// Номенклатура с разным качеством должна быть совместима по настройкам серий:
	// - или у серий должен быть один владелец (тогда настройки учета совпадают)
	// - или учета серий быть не должно.
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|	Товары.НоменклатураОприходование КАК НоменклатураБрак
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДляЗапроса.НомерСтроки,
	|	ТоварыДляЗапроса.Номенклатура,
	|	ТоварыДляЗапроса.НоменклатураБрак,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ТоварыДляЗапроса.Номенклатура КАК Справочник.Номенклатура).ВладелецСерий = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ТоварыДляЗапроса.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры
	|		ИНАЧЕ ВЫРАЗИТЬ(ТоварыДляЗапроса.Номенклатура КАК Справочник.Номенклатура).ВладелецСерий
	|	КОНЕЦ КАК ВладелецСерий,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ТоварыДляЗапроса.НоменклатураБрак КАК Справочник.Номенклатура).ВладелецСерий = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(ТоварыДляЗапроса.НоменклатураБрак КАК Справочник.Номенклатура).ВидНоменклатуры
	|		ИНАЧЕ ВЫРАЗИТЬ(ТоварыДляЗапроса.НоменклатураБрак КАК Справочник.Номенклатура).ВладелецСерий
	|	КОНЕЦ КАК ВладелецСерийБрак
	|ПОМЕСТИТЬ ТоварыДляЗапроса
	|ИЗ
	|	Товары КАК ТоварыДляЗапроса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДляЗапроса.НомерСтроки,
	|	ТоварыДляЗапроса.Номенклатура КАК Номенклатура,
	|	ТоварыДляЗапроса.НоменклатураБрак КАК НоменклатураБрак
	|ИЗ
	|	ТоварыДляЗапроса КАК ТоварыДляЗапроса
	|ГДЕ
	|	ТоварыДляЗапроса.ВладелецСерий <> ТоварыДляЗапроса.ВладелецСерийБрак
	|	И (ТоварыДляЗапроса.ВладелецСерий.ИспользоватьСерии
	|		ИЛИ ТоварыДляЗапроса.ВладелецСерийБрак.ИспользоватьСерии)";
	
	Если ТаблицаДляПроверки <> Неопределено Тогда
		Запрос.УстановитьПараметр("Товары", ТаблицаДляПроверки);
	Иначе
		Запрос.УстановитьПараметр("Товары",
			Объект[ИмяТЧДляПроверки].Выгрузить(,"НомерСтроки,Номенклатура,НоменклатураОприходование"));
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = НСтр("ru = 'По номенклатурам %Номенклатура% и %НоменклатураБрак%(испорченный товар) различаются настройки учета по сериям.';
							|en = 'Settings of series accounting differ for products %Номенклатура% and %НоменклатураБрак% (spoiled goods).'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Номенклатура%", Выборка.Номенклатура);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НоменклатураБрак%", Выборка.НоменклатураБрак);
		Если ТаблицаДляПроверки = Неопределено Тогда
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧДляПроверки,Выборка.НомерСтроки,"НоменклатураОприходование");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,Объект,Поле,,Отказ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// -- rarus makole 2021-06-23 [РАIT-0023374]
